{"product_id":"P001","product_name":"Mints - Striped Red","product_brand":"ExampleTech","product_description":"Maecenas leo odio, condimentum id, luctus nec, molestie sed, justo. Pellentesque viverra pede ac diam. Cras pellentesque volutpat dui.","product_price":799.7,"product_currency":"CNY","product_availability":true,"product_stock_quantity":235,"product_color":"Puce","product_specifications":[{"product_screen_size":"6.5 inches","product_camera":"Triple-lens 12MP+16MP+20MP","product_storage":"128GB","product_RAM":"8GB","product_battery_capacity":"4000mAh","product_processor":"Octa-core Snapdragon 888"}],"product_customer_reviews":[{"customer_username":"aglasner0","customer_rating":0.0,"customer_review":"Aliquam non mauris. Morbi non lectus. Aliquam sit amet diam in magna bibendum imperdiet. Nullam orci pede, venenatis non, sodales sed, tincidunt eu, felis. Fusce posuere felis sed lacus. Morbi sem mauris, laoreet ut, rhoncus aliquet, pulvinar sed, nisl. Nunc rhoncus dui vel sem. Sed sagittis."},{"customer_username":"agrafton1","customer_rating":0.3,"customer_review":"Curabitur at ipsum ac tellus semper interdum. Mauris ullamcorper purus sit amet nulla. Quisque arcu libero, rutrum ac, lobortis vel, dapibus at, diam. Nam tristique tortor eu pede."},{"customer_username":"hrobbel2","customer_rating":2.5,"customer_review":"Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Vivamus vestibulum sagittis sapien. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Etiam vel augue. Vestibulum rutrum rutrum neque. Aenean auctor gravida sem. Praesent id massa id nisl venenatis lacinia. Aenean sit amet justo."},{"customer_username":"rtankin3","customer_rating":2.4,"customer_review":"Integer pede justo, lacinia eget, tincidunt eget, tempus vel, pede. Morbi porttitor lorem id ligula. Suspendisse ornare consequat lectus. In est risus, auctor sed, tristique in, tempus sit amet, sem. Fusce consequat. Nulla nisl."},{"customer_username":"vsuttle4","customer_rating":1.0,"customer_review":"Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Mauris viverra diam vitae quam. Suspendisse potenti."},{"customer_username":"jdenajera5","customer_rating":0.8,"customer_review":"Fusce posuere felis sed lacus. Morbi sem mauris, laoreet ut, rhoncus aliquet, pulvinar sed, nisl. Nunc rhoncus dui vel sem."},{"customer_username":"wmorfield6","customer_rating":4.6,"customer_review":"Pellentesque viverra pede ac diam. Cras pellentesque volutpat dui."}]}
